## Global Historical Climatology Network Dataset
Variables are stored in both rows and columns
This dataset represents the daily weather records for a weather station (MX17004) in Mexico for five months in 2010.

In [1]:
import pandas as pd
weather_df = pd.read_csv('../weather-raw.csv')
weather_df.head()

,id,year,month,element,d1,d2,d3,d4,d5,d6,...,d22,d23,d24,d25,d26,d27,d28,d29,d30,d31
0,MX17004,2010,1,tmax,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,27.8,NaN
1,MX17004,2010,1,tmin,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,14.5,NaN
2,MX17004,2010,2,tmax,NaN,27.3,24.1,NaN,NaN,NaN,...,NaN,29.9,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,MX17004,2010,2,tmin,NaN,14.4,14.4,NaN,NaN,NaN,...,NaN,10.7,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,MX17004,2010,3,tmax,NaN,NaN,NaN,NaN,32.1,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [2]:
clean_weather = pd.melt(weather_df, id_vars=['id','year','month','element'],
                       var_name='day', value_name='temperature')
clean_weather

          id  year  month element  day  temperature
0    MX17004  2010      1    tmax   d1          NaN
1    MX17004  2010      1    tmin   d1          NaN
2    MX17004  2010      2    tmax   d1          NaN
3    MX17004  2010      2    tmin   d1          NaN
4    MX17004  2010      3    tmax   d1          NaN
..       ...   ...    ...     ...  ...          ...
677  MX17004  2010     10    tmin  d31          NaN
678  MX17004  2010     11    tmax  d31          NaN
679  MX17004  2010     11    tmin  d31          NaN
680  MX17004  2010     12    tmax  d31          NaN
681  MX17004  2010     12    tmin  d31          NaN

[682 rows x 6 columns]

In [3]:
set(clean_weather['id'])

{'MX17004'}

In [4]:
clean_weather.drop('id', axis=1, inplace=True)

In [5]:
clean_weather

     year  month element  day  temperature
0    2010      1    tmax   d1          NaN
1    2010      1    tmin   d1          NaN
2    2010      2    tmax   d1          NaN
3    2010      2    tmin   d1          NaN
4    2010      3    tmax   d1          NaN
..    ...    ...     ...  ...          ...
677  2010     10    tmin  d31          NaN
678  2010     11    tmax  d31          NaN
679  2010     11    tmin  d31          NaN
680  2010     12    tmax  d31          NaN
681  2010     12    tmin  d31          NaN

[682 rows x 5 columns]

In [6]:
set(clean_weather['year'])

{2010}

In [7]:
clean_weather.drop('year', axis=1, inplace=True)
clean_weather

     month element  day  temperature
0        1    tmax   d1          NaN
1        1    tmin   d1          NaN
2        2    tmax   d1          NaN
3        2    tmin   d1          NaN
4        3    tmax   d1          NaN
..     ...     ...  ...          ...
677     10    tmin  d31          NaN
678     11    tmax  d31          NaN
679     11    tmin  d31          NaN
680     12    tmax  d31          NaN
681     12    tmin  d31          NaN

[682 rows x 4 columns]

In [8]:
clean_weather = clean_weather[clean_weather['temperature'].notna()]

In [9]:
clean_weather

     month element  day  temperature
20      12    tmax   d1         29.9
21      12    tmin   d1         13.8
24       2    tmax   d2         27.3
25       2    tmin   d2         14.4
40      11    tmax   d2         31.3
..     ...     ...  ...          ...
631      8    tmin  d29         15.3
638      1    tmax  d30         27.8
639      1    tmin  d30         14.5
674      8    tmax  d31         25.4
675      8    tmin  d31         15.4

[66 rows x 4 columns]

In [10]:
clean_weather['day'] = clean_weather['day'].str.replace('d','')

/home/jonnyteronni/Documents/Programs/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [11]:
clean_weather

     month element day  temperature
20      12    tmax   1         29.9
21      12    tmin   1         13.8
24       2    tmax   2         27.3
25       2    tmin   2         14.4
40      11    tmax   2         31.3
..     ...     ...  ..          ...
631      8    tmin  29         15.3
638      1    tmax  30         27.8
639      1    tmin  30         14.5
674      8    tmax  31         25.4
675      8    tmin  31         15.4

[66 rows x 4 columns]